; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
(define (problem blocksworld-36)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 - object)
 (:init 
    (arm-empty)
    (clear b2)
    (on b2 b10)
    (on b10 b3)
    (on b3 b7)
    (on b7 b1)
    (on b1 b6)
    (on b6 b4)
    (on-table b4)
    (clear b9)
    (on b9 b5)
    (on b5 b11)
    (on b11 b8)
    (on-table b8))
 (:goal (and 
(on-table b4)
(on b11 b3)
))
)

; plan
1. (unstack b2 b10)
   deleted: (on b2 b10) (clear b2) (arm-empty)
   added: (holding b2) (clear b10)
   goals met: 1 of 2
2. (putdown b2)
   deleted: (holding b2)
   added: (clear b2) (arm-empty) (on-table b2)
   goals met: 1 of 2
3. (unstack b10 b3)
   deleted: (on b10 b3) (clear b10) (arm-empty)
   added: (holding b10) (clear b3)
   goals met: 1 of 2
4. (putdown b10)
   deleted: (holding b10)
   added: (clear b10) (arm-empty) (on-table b10)
   goals met: 1 of 2
5. (unstack b9 b5)
   deleted: (on b9 b5) (clear b9) (arm-empty)
   added: (holding b9) (clear b5)
   goals met: 1 of 2
6. (putdown b9)
   deleted: (holding b9)
   added: (clear b9) (arm-empty) (on-table b9)
   goals met: 1 of 2
7. (unstack b5 b11)
   deleted: (on b5 b11) (clear b5) (arm-empty)
   added: (holding b5) (clear b11)
   goals met: 1 of 2
8. (putdown b5)
   deleted: (holding b5)
   added: (clear b5) (arm-empty) (on-table b5)
   goals met: 1 of 2
9. (unstack b11 b8)
   deleted: (on b11 b8) (clear b11) (arm-empty)
   added: (holding b11) (clear b8)
   goals met: 1 of 2
10. (stack b11 b3)
   deleted: (clear b3) (holding b11)
   added: (arm-empty) (clear b11) (on b11 b3)
   goals met: 2 of 2
